// TypeScript এবং JavaScript এর সাধারণ অবজেক্ট ডেটা স্ট্রাকচার সাপোর্ট করে, এবং Index Signatures একটি গুরুত্বপূর্ণ ফিচার যা
//অবজেক্টের ডাইনামিক প্রোপার্টিগুলি ডিফাইন করতে সাহায্য করে।
// এটি অবজেক্টের প্রোপার্টির নাম এবং ডেটা টাইপ দিয়ে ডিফাইন করা যায়,
//যাতে সময়ের সাথে নতুন প্রোপার্টি যোগ করা যায় বা ডাইনামিক প্রোপার্টি অ্যাক্সেস করা যায়।

// {
//     [propertyName: string]: propertyType;
// }
// propertyName হলো ইন্ডেক্স প্রোপার্টির নাম, যা স্ট্রিং হতে হবে। এটি অবজেক্টের প্রোপার্টির নাম ডাইনামিকভাবে প্রদান করে থাকতে পারে।

// propertyType হলো সে ডেটা টাইপ যা ইন্ডেক্স প্রোপার্টির জন্য সেট করা হবে।
// একটি অবজেক্ট ডিফাইন করা যাক যা ইন্ডেক্স সাইনেচার ব্যবহার করে
let person2: {
    [key: string]: string;
} = {};

person2["name"] = "John";
person2["age"] = "30";

console.log(person2["name"]); // "John"
console.log(person2["age"]); // "30"
console.log(person2["address"]); // undefined

//  person অবজেক্টের প্রোপার্টি নামের জন্য ইন্ডেক্স সাইনেচার ব্যবহার করা হয়েছে, এবং সে প্রোপার্টিগুলির ডেটা টাইপ স্ট্রিং হয়েছে।
// এর পরে আমরা ইন্ডেক্স প্রোপার্টি সাধারণভাবে অ্যাক্সেস করতে পারি এবং নতুন প্রোপার্টি যোগ করতে পারি সেই ইন্ডেক্স প্রোপার্টির মাধ্যমে।
// Index Signatures ব্যবহার করা হয় যখন আপনি একটি অবজেক্টের ডাইনামিক প্রোপার্টি সেট করতে এবং এই প্রোপার্টিগুলির ডেটা টাইপ সেট করতে চান, যেটি স্ট্রিং নাম দ্বারা পরিচিত হবে।